## **Como Utilizar o `groupby` do pandas?**

In [2]:
import seaborn as sns
import pandas as pd

In [6]:
pg_df = sns.load_dataset("penguins")
pg_df = pg_df[["species", "island", "bill_length_mm", "bill_depth_mm"]]

## **Como functiona o `groupby` do pandas?**

![groupby](../../image/groupby.png)

In [7]:
pg_df

    species     island  bill_length_mm  bill_depth_mm
0    Adelie  Torgersen            39.1           18.7
1    Adelie  Torgersen            39.5           17.4
2    Adelie  Torgersen            40.3           18.0
3    Adelie  Torgersen             NaN            NaN
4    Adelie  Torgersen            36.7           19.3
..      ...        ...             ...            ...
339  Gentoo     Biscoe             NaN            NaN
340  Gentoo     Biscoe            46.8           14.3
341  Gentoo     Biscoe            50.4           15.7
342  Gentoo     Biscoe            45.2           14.8
343  Gentoo     Biscoe            49.9           16.1

[344 rows x 4 columns]

In [8]:
pg_df.groupby("species").median()

           bill_length_mm  bill_depth_mm
species
Adelie              38.80          18.40
Chinstrap           49.55          18.45
Gentoo              47.30          15.00

In [11]:
pg_df.groupby(["species", "island"]).median()[["bill_length_mm"]]

                     bill_length_mm
species   island
Adelie    Biscoe              38.70
          Dream               38.55
          Torgersen           38.90
Chinstrap Dream               49.55
Gentoo    Biscoe              47.30